
# A Crash Course in Python - Mysql 
##### Instructor: [Mirza Tauseef]

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in d:\anaconda3\lib\site-packages (8.0.27)
Requirement already satisfied: protobuf>=3.0.0 in d:\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.3)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 22.1.1 is available.
You should consider upgrading via the 'd:\anaconda3\python.exe -m pip install --upgrade pip' command.

# Lets Start with a simple CRUD Operation

In [2]:
# Import Mysql Connector
import mysql.connector
from mysql.connector import errorcode

In [5]:
# Create Dictionary for Credentials
config = {
    'user': 'root',
    'password': '',
    'host': 'localhost'
}

In [6]:
# This takes a keyword argument
db = mysql.connector.connect(**config)

In [7]:
# Cursor is used to execute queries. Its like a pointer
cursor = db.cursor()

In [12]:
# Now we need to declare db name
DB_NAME = 'clinic'

In [14]:
# def is used to define the function
# Let's create a function to create a database
def create_db():
    cursor.execute("CREATE DATABASE IF NOT EXISTS {} DEFAULT CHARACTER SET 'utf8'".format(DB_NAME))
    print("Database {} created!".format(DB_NAME))

create_db()

Database clinic created!

In [13]:
# Initialize Tables as an empty dictionary
TABLES = {}

TABLES['logs'] = (
    "CREATE TABLE `logs` ("
    " `id` int(11) NOT NULL AUTO_INCREMENT,"
    " `notes` varchar(250) NOT NULL,"
    " `user` varchar(250) NOT NULL,"
    " `created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,"
    " PRIMARY KEY (`id`)"
    ") ENGINE=InnoDB"
)

In [15]:
def create_tables():
    cursor.execute("USE {}".format(DB_NAME))

    for table_name in TABLES:
        table_description = TABLES[table_name]
        try:
            print("Creating table ({}) ".format(table_name), end="")
            cursor.execute(table_description)
        except mysql.connector.Error as err:
            if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
                print("Already Exists")
            else:
                print(err.msg)

In [16]:
# Create Tables
create_tables()

Creating table (logs)

In [17]:
def add_log(notes, user):
    sql = ("INSERT INTO logs(notes, user) VALUES (%s, %s)")
    cursor.execute(sql, (notes, user,))
    db.commit()
    log_id = cursor.lastrowid
    print("Added log {}".format(log_id))

In [18]:
add_log('This is log one', 'SK')
add_log('This is log two', 'Admin')
add_log('This is log three', 'Kiddie')

Added log 1
Added log 2
Added log 3

In [20]:
def get_log(id):
    sql = ("SELECT * FROM logs WHERE id = %s")
    cursor.execute(sql, (id,))
    result = cursor.fetchone()

    for row in result:
        print(row)

In [23]:
get_log(1)
get_log(2)

1
This is log one
SK
2021-11-09 16:01:24
2
This is log two
Admin
2021-11-09 16:01:24

In [24]:
def update_log(id, notes):
    sql = ("UPDATE logs SET notes = %s WHERE id = %s")
    cursor.execute(sql, (notes, id))
    db.commit()
    print("Log updated")

In [25]:
update_log(2, 'Updated log')

Log updated

In [26]:
def delete_log(id):
    sql = ("DELETE FROM logs WHERE id = %s")
    cursor.execute(sql, (id,))
    db.commit()
    print("Log removed")

In [27]:
delete_log(2)

Log removed

In [41]:
def get_logs():
    sql = ("SELECT * FROM logs ORDER BY created DESC")
    cursor.execute(sql)
    result = cursor.fetchall()

    for row in result:
        print(row[0], " ", row[1], " ", row[2])

In [42]:
get_logs()

3   This is log three   Kiddie
1   This is log one   SK

# Intro to pandas

## What kind of data does pandas handle?
## When working with tabular data, such as data stored in spreadsheets or databases, pandas is the right tool for you. pandas will help you to explore, clean, and process your data. In pandas, a data table is called a DataFrame.

<img src="images/01_table_dataframe.svg">

In [43]:
# Lets Start Using Pandas
import pandas as pd

In [44]:
# Lets store passenger data of the Titanic
# Constructing DataFrame from a dictionary.
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [45]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [49]:
# When selecting a single column of a pandas DataFrame, the result is a pandas Series.
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [47]:
df["Age"].max()

58

In [48]:
# Lets do some basic statistics of the numerical data of my data table
# The describe() method provides a quick overview of the numerical data in a DataFrame.
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

# Now the Question is how we can import data from a MySQL database into Pandas data frame

In [52]:
sql = "SELECT * FROM logs"
df = pd.read_sql(sql, db)

In [55]:
df.head(1)

   id            notes user             created
0   1  This is log one   SK 2021-11-09 16:01:24

In [57]:
# Lets convert our dataframe into CSV.
df.to_csv('csv/Test.csv')

# Lets import CSV into Pandas data frame

In [58]:
df_csv = pd.read_csv('csv/Test.csv')

In [59]:
df_csv

   Unnamed: 0  id              notes    user              created
0           0   1    This is log one      SK  2021-11-09 16:01:24
1           1   3  This is log three  Kiddie  2021-11-09 16:01:25

In [ ]:
# pd.read_excel
# pd.read_feather
# pd.read_gbq
# pd.read_html
# pd.read_json
# pd.read_orc
# pd.read_parquet
# pd.read_pickle
# pd.read_sas
# pd.read_spss
# pd.read_sql
# pd.read_sql_query
# pd.read_sql_table
# pd.read_table
# pd.read_xml
# pd.read_clipboard
# pd.read_stata